bluffBody/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          200;
        startFace       2700;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       2900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       3000;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       3100;
    }
    upperWall
    {
        type            patch;
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
